; domain
(define (domain room-planning)
    (:requirements :strips :typing :negative-preconditions)
    (:types 
        room
        object
        agent
    )
    (:predicates 
        (room ?r - room)
        (object ?o - object)
        (agent ?a - agent)
        (adjacent ?r1 ?r2 - room)
        (at ?o - object ?r1 - room)
        (carrying ?o - object ?a - agent)
        (in-room ?a - agent ?r1 - room)
        (busy ?a - agent)
    )

    (:action move
        :parameters (?a - agent ?r1 - room ?r2 - room)
        :precondition (and 
            (agent ?a) 
            (room ?r1)
            (room ?r2)
            (in-room ?a ?r1)
            (not (in-room ?a ?r2))
            (adjacent ?r1 ?r2)
        )
        :effect (and 
            (not (in-room ?a ?r1))
            (in-room ?a ?r2)
        )
    )
    (:action pick-up
        :parameters (?a - agent ?o - object ?r - room)
        :precondition (and 
            (agent ?a) 
            (object ?o)
            (room ?r)
            (not (busy ?a))
            (in-room ?a ?r)
            (at ?o ?r)
            (not (carrying ?o ?a)) ; Redundant
        )
        :effect (and 
            (carrying ?o ?a)
            (not (at ?o ?r))
            (busy ?a)
        )
    )

    (:action put-down
        :parameters (?a - agent ?o - object ?r - room)
        :precondition (and 
            (agent ?a) 
            (object ?o)
            (room ?r)
            (in-room ?a ?r)
            (carrying ?o ?a)
        )
        :effect (and 
            (not (carrying ?o ?a))
            (at ?o ?r)
            (not (busy ?a))
        )
    )

)

; problem
(define (problem room-planning)
  (:domain room-planning)

  (:objects
    knife laptop pillow soap - object
    kitchen home_office bedroom bathroom - room
    Agent47 - agent
  )

  (:init
    (room kitchen)
    (room home_office)
    (room bedroom)
    (room bathroom)
    (object knife)
    (object laptop)
    (object pillow)
    (object soap)
    (agent Agent47)
    (adjacent kitchen home_office)
    (adjacent home_office bedroom)
    (adjacent bathroom bedroom)
    (adjacent kitchen bathroom)
    (adjacent bedroom kitchen)
    (at knife bedroom)
    (at laptop home_office)
    (at pillow kitchen)
    (at soap home_office)
    (in-room Agent47 kitchen)
    )

(:goal
    (and
        (at pillow bedroom)
        (at knife kitchen)
        (at laptop home_office)
        (at soap bathroom)
    )
)

)

; plan
1. (move agent47 kitchen home_office)
   deleted: (in-room agent47 kitchen)
   added: (in-room agent47 home_office)
   goals met: 1 of 4
2. (pick-up agent47 soap home_office)
   deleted: (at soap home_office)
   added: (carrying soap agent47) (busy agent47)
   goals met: 1 of 4
3. (move agent47 home_office bedroom)
   deleted: (in-room agent47 home_office)
   added: (in-room agent47 bedroom)
   goals met: 1 of 4
4. (move agent47 bedroom kitchen)
   deleted: (in-room agent47 bedroom)
   added: (in-room agent47 kitchen)
   goals met: 1 of 4
5. (move agent47 kitchen bathroom)
   deleted: (in-room agent47 kitchen)
   added: (in-room agent47 bathroom)
   goals met: 1 of 4
6. (put-down agent47 soap bathroom)
   deleted: (carrying soap agent47) (busy agent47)
   added: (at soap bathroom)
   goals met: 2 of 4
7. (move agent47 bathroom bedroom)
   deleted: (in-room agent47 bathroom)
   added: (in-room agent47 bedroom)
   goals met: 2 of 4
8. (pick-up agent47 knife bedroom)
   deleted: (at knife bedroom)
   added: (carrying knife agent47) (busy agent47)
   goals met: 2 of 4
9. (move agent47 bedroom kitchen)
   deleted: (in-room agent47 bedroom)
   added: (in-room agent47 kitchen)
   goals met: 2 of 4
10. (put-down agent47 knife kitchen)
   deleted: (carrying knife agent47) (busy agent47)
   added: (at knife kitchen)
   goals met: 3 of 4
11. (pick-up agent47 pillow kitchen)
   deleted: (at pillow kitchen)
   added: (carrying pillow agent47) (busy agent47)
   goals met: 3 of 4
12. (move agent47 kitchen home_office)
   deleted: (in-room agent47 kitchen)
   added: (in-room agent47 home_office)
   goals met: 3 of 4
13. (move agent47 home_office bedroom)
   deleted: (in-room agent47 home_office)
   added: (in-room agent47 bedroom)
   goals met: 3 of 4
14. (put-down agent47 pillow bedroom)
   deleted: (carrying pillow agent47) (busy agent47)
   added: (at pillow bedroom)
   goals met: 4 of 4
